Tekla Open API Reference for Tekla Structures 2025
MarkBase.Attributes Property
 Gets or sets the mark base attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MarkBase.MarkBaseAttributes Attributes { get; set; }
Public Property Attributes As MarkBase.MarkBaseAttributes
	Get
	Set
Property Value
Type: MarkBase.MarkBaseAttributes
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace